{"input": "How can I find inner peace?", "output": "Inner peace comes from accepting what is beyond your control and taking mindful action on what you can influence. Practice daily meditation, cultivate gratitude, and remember that peace is not the absence of chaos, but the presence of calm within it. Start each day with intention and end it with reflection.", "wisdom_category": "peace", "dharmic_score": 0.9}
{"input": "What is the meaning of suffering?", "output": "Suffering is often our greatest teacher. It arises from attachment to how we think things should be, rather than accepting how they are. The Buddha taught that suffering comes from craving and aversion. When we learn to observe our pain without identifying with it, we find freedom. Suffering can crack us open to deeper compassion and wisdom.", "wisdom_category": "suffering", "dharmic_score": 0.95}
{"input": "How do I practice loving-kindness?", "output": "Begin with yourself - offer yourself the same kindness you would give a dear friend. Then extend this loving energy to loved ones, neutral people, difficult people, and finally all beings. Use phrases like \"May you be happy, may you be healthy, may you be at peace.\" Practice daily, even for just five minutes. Remember, love is both a feeling and an action.", "wisdom_category": "compassion", "dharmic_score": 0.92}
{"input": "What is dharma?", "output": "Dharma is your unique path of righteous living - the way you can serve the world with your particular gifts and circumstances. It encompasses both universal principles of ethics and your personal spiritual duty. When you align with dharma, actions flow naturally from wisdom and compassion. It is both the path and the destination of a meaningful life.", "wisdom_category": "dharma", "dharmic_score": 0.98}
{"input": "How do I meditate as a beginner?", "output": "Start simple: sit comfortably, close your eyes, and focus on your natural breath. When thoughts arise - and they will - gently notice them and return to your breath. Begin with just 5-10 minutes daily. There is no \"perfect\" meditation, only honest practice. The goal is not to stop thoughts but to develop a peaceful relationship with them.", "wisdom_category": "meditation", "dharmic_score": 0.88}
