{
  "name": "Taittiriya Upanishad",
  "text": "The Upanishads, Part 2 (SBE15), by Max Müller, [1879], at sacred-texts.com\n\np. xxvi\n\nTHIS is an Upanishad of the Atharva-veda. It is a Mantra-upanishad, i.e. it has the form of a Mantra. But, as the commentators observe, though it is written in verse, it is not, like other Mantras, to be used for sacrificial purposes. Its only object is to teach the highest knowledge, the knowledge of Brahman, which cannot be obtained either by sacrifices or by worship (upâsana), but by such teaching only as is imparted in the Upanishad. A man may a hundred times restrain his breath, &c., but without the Upanishad his ignorance does not cease. Nor is it right to continue for ever in the performance of sacrificial and other good works, if one wishes to obtain the highest knowledge of Brahman. The Sannyâsin alone, who has given up everything, is qualified to know and to become Brahman. And though it might seem from Vedic legends that Grihasthas also who continued to live with their families, performing all the duties required of them by law, had been in possession of the highest knowledge, this, we are told, is a mistake. Works and knowledge can be as little together as darkness and light.\n\nThis Upanishad too has been often translated since it first appeared in the Persian translation of Dârâ Shukoh. My own copy of the text and Saṅkara's commentary from the MS. in the Chambers Collection was made in October 1844. Both are now best accessible in the Bibliotheca Indica, where Dr. Roer has published the text, the commentary by Saṅkara, a gloss by Ânandagñâna, and an English translation with notes.\n\nThe title of the Upanishad, Mundaka, has not yet been explained. The Upanishad is called Mundaka-upanishad, and its three chapters are each called Mundakam. Native commentators explain it as the shaving Upanishad, that is, as the Upanishad which cuts off the errors of the mind, like a razor. Another Upanishad also is called Kshurikâ, the razor, a name which is explained in the text itself as\n\np. xxvii\n\nmeaning an instrument for removing illusion and error. The title is all the more strange because Mundaka, in its commonest acceptation, is used as a term of reproach for Buddhist mendicants, who are called 'Shavelings,' in opposition to the Brâhmans, who dress their hair carefully, and often display by its peculiar arrangement either their family or their rank. Many doctrines of the Upanishads are, no doubt, pure Buddhism, or rather Buddhism is on many points the consistent carrying out of the principles laid down in the Upanishads. Yet, for that very reason, it seems impossible that this should be the origin of the name, unless we suppose that it was the work of a man who was, in one sense, a Mundaka, and yet faithful to the Brahmanic law.\n\nNext: III: The Taittirîyaka-Upanishad\n\n\n\n\nSacred Texts | \nHinduism\n\n\n\n\n\n« Previous: The Upanishads, Part 2 (SBE15): Introduction: I: The Kath...\n\n\nIndex\n\n\nNext: The Upanishads, Part 2 (SBE15): Introduction: III: The Ta... »\n\nSacred Texts | \nHinduism",
  "url": "https://www.sacred-texts.com/hin/sbe15/sbe15004.htm"
}