{
  "title": "Ethical Dilemmas and Vashishta's Guidance",
  "introduction": "Dharma is not always black and white. Here are common dilemmas and how to navigate them.",
  "dilemmas": [
    {
      "dilemma": "Truth vs Compassion",
      "scenario": "You know a painful truth that will hurt someone. Should you speak it?",
      "vashishta_guidance": "Truth must be beneficial (हितम्). If truth causes unnecessary harm without benefit, silence or skillful speech is better. Ask: Will this truth help them grow, or just cause pain? If it helps, speak with compassion. If not, remain silent or find a gentler way.",
      "principle": "Satya (truth) must be combined with Ahimsa (non-harm)"
    },
    {
      "dilemma": "Personal vs Family Duty",
      "scenario": "Your personal goals conflict with family expectations. Which takes priority?",
      "vashishta_guidance": "First, genuinely listen to family concerns - they may see what you don't. Then, if your path is dharmic and benefits not just you but ultimately others, follow it with respect. Explain your reasoning, seek compromise where possible, but don't sacrifice your svadharma (personal duty) entirely. A forced life creates resentment.",
      "principle": "Balance Kula-dharma (family duty) with Svadharma (personal duty)"
    },
    {
      "dilemma": "Wealth vs Ethics",
      "scenario": "You can earn more money through slightly unethical means. Everyone does it. Should you?",
      "vashishta_guidance": "Absolutely not. Wealth earned through adharma brings anxiety, guilt, and karmic debt. You may gain money but lose peace. The truly wise person earns less with integrity than more with compromise. Trust that dharma supports those who follow it. Your character is your true wealth.",
      "principle": "Never sacrifice Dharma for Artha"
    },
    {
      "dilemma": "Forgiveness vs Justice",
      "scenario": "Someone wronged you deeply. Should you forgive or seek justice?",
      "vashishta_guidance": "Forgiveness is for your own peace - holding anger hurts you most. But forgiveness doesn't mean enabling harmful behavior. You can forgive internally while still maintaining boundaries or seeking appropriate consequences. Justice protects others from harm. True forgiveness is releasing the poison of hatred, not accepting abuse.",
      "principle": "Kshama (forgiveness) with Viveka (discrimination)"
    },
    {
      "dilemma": "Ambition vs Contentment",
      "scenario": "Should I strive for more, or be content with what I have?",
      "vashishta_guidance": "Strive dharmic ally, but remain content internally. Work with full effort but without attachment to results. Ambition rooted in dharma and service is noble. Ambition rooted in greed and comparison is suffering. The key is: Are you pursuing this for growth and contribution, or to fill an inner void? Fill the void with spiritual practice, then pursue outer goals from wholeness.",
      "principle": "Karma Yoga - Action without attachment"
    },
    {
      "dilemma": "Self-Care vs Selflessness",
      "scenario": "Others need me constantly. When is self-care selfish vs necessary?",
      "vashishta_guidance": "You cannot pour from an empty cup. Taking care of your health, peace, and growth is not selfish - it's responsible. Otherwise you burn out and help no one. Set loving boundaries. Serve from overflow, not depletion. Even airlines tell you to put on your own oxygen mask first. Self-care IS dharma when done to sustain your ability to serve.",
      "principle": "Sustainable compassion requires self-compassion"
    },
    {
      "dilemma": "Tradition vs Progress",
      "scenario": "Old ways are outdated, but elders insist. Should I follow or rebel?",
      "vashishta_guidance": "Honor the wisdom in tradition while being open to beneficial change. Ask: What is the principle behind this tradition? Can that principle be honored in a new form? Respect elders even when disagreeing. Don't throw out ancient wisdom because it's old, but don't cling to harmful practices just because they're traditional. The eternal principles of dharma remain; their expressions evolve.",
      "principle": "Sanatana (eternal) vs Kalika (time-bound)"
    }
  ]
}