[
  {
    "id": "gita_ch1_v1",
    "source": "Bhagavad Gita",
    "category": "scripture",
    "chapter": 1,
    "verse": 1,
    "sanskrit": "धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः। मामकाः पाण्डवाश्चैव किमकुर्वत सञ्जय॥",
    "transliteration": "dharma-kṣetre kuru-kṣetre samavetā yuyutsavaḥ māmakāḥ pāṇḍavāś caiva kim akurvata sañjaya",
    "english": "O Sanjaya, after gathering on the holy field of Kurukshetra, what did my sons and the sons of Pandu do, being desirous to fight?",
    "commentary": "The blind king Dhritarashtra asks his secretary Sanjaya about the battle preparations.",
    "tags": [
      "gita",
      "krishna",
      "arjuna",
      "dharma",
      "yoga"
    ],
    "timestamp": "2025-10-04T14:17:22.477002"
  },
  {
    "id": "gita_ch1_v47",
    "source": "Bhagavad Gita",
    "category": "scripture",
    "chapter": 1,
    "verse": 47,
    "sanskrit": "एवमुक्त्वार्जुनः सङ्ख्ये रथोपस्थ उपाविशत्। विसृज्य सशरं चापं शोकसंविग्नमानसः॥",
    "transliteration": "evam uktvārjunaḥ saṅkhye rathopastha upāviśat visṛjya sa-śaraṁ cāpaṁ śoka-saṁvigna-mānasaḥ",
    "english": "Having spoken thus at the battlefield, Arjuna cast aside his bow and arrows and sat down on the chariot, his mind overwhelmed with grief.",
    "commentary": "Arjuna's confusion and emotional breakdown before the battle begins.",
    "tags": [
      "gita",
      "krishna",
      "arjuna",
      "dharma",
      "yoga"
    ],
    "timestamp": "2025-10-04T14:17:22.477033"
  },
  {
    "id": "gita_ch2_v47",
    "source": "Bhagavad Gita",
    "category": "scripture",
    "chapter": 2,
    "verse": 47,
    "sanskrit": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
    "transliteration": "karmaṇy-evādhikāras te mā phaleṣu kadācana mā karma-phala-hetur bhūr mā te saṅgo 'stvakarmaṇi",
    "english": "You have a right to perform your prescribed duty, but you are not entitled to the fruits of action. Never consider yourself the cause of the results of your activities, and never be attached to not doing your duty.",
    "commentary": "The most famous verse - teaching of Karma Yoga (action without attachment to results).",
    "tags": [
      "gita",
      "krishna",
      "arjuna",
      "dharma",
      "yoga"
    ],
    "timestamp": "2025-10-04T14:17:22.477040"
  },
  {
    "id": "gita_ch2_v48",
    "source": "Bhagavad Gita",
    "category": "scripture",
    "chapter": 2,
    "verse": 48,
    "sanskrit": "योगस्थः कुरु कर्माणि सङ्गं त्यक्त्वा धनञ्जय। सिद्ध्यसिद्ध्योः समो भूत्वा समत्वं योग उच्यते॥",
    "transliteration": "yoga-sthaḥ kuru karmāṇi saṅgaṁ tyaktvā dhanañjaya siddhy-asiddhyoḥ samo bhūtvā samatvaṁ yoga ucyate",
    "english": "Perform your duty equipoised, O Arjuna, abandoning all attachment to success or failure. Such equanimity is called Yoga.",
    "commentary": "Definition of Yoga as equanimity in all circumstances.",
    "tags": [
      "gita",
      "krishna",
      "arjuna",
      "dharma",
      "yoga"
    ],
    "timestamp": "2025-10-04T14:17:22.477045"
  },
  {
    "id": "gita_ch2_v56",
    "source": "Bhagavad Gita",
    "category": "scripture",
    "chapter": 2,
    "verse": 56,
    "sanskrit": "दुःखेष्वनुद्विग्नमनाः सुखेषु विगतस्पृहः। वीतरागभयक्रोधः स्थितधीर्मुनिरुच्यते॥",
    "transliteration": "duḥkheṣv-anudvigna-manāḥ sukheṣu vigata-spṛhaḥ vīta-rāga-bhaya-krodhaḥ sthita-dhīr munir ucyate",
    "english": "One who is not disturbed in mind even amidst the threefold miseries, who is not elated when there is happiness, and who is free from attachment, fear and anger, is called a sage of steady mind.",
    "commentary": "Characteristics of a person with steady wisdom (sthitaprajna).",
    "tags": [
      "gita",
      "krishna",
      "arjuna",
      "dharma",
      "yoga"
    ],
    "timestamp": "2025-10-04T14:17:22.477053"
  },
  {
    "id": "gita_ch3_v3",
    "source": "Bhagavad Gita",
    "category": "scripture",
    "chapter": 3,
    "verse": 3,
    "sanskrit": "श्रीभगवानुवाच। लोकेऽस्मिन्द्विविधा निष्ठा पुरा प्रोक्ता मयानघ। ज्ञानयोगेन साङ्ख्यानां कर्मयोगेन योगिनाम्॥",
    "transliteration": "śrī-bhagavān uvāca loke 'smin dvi-vidhā niṣṭhā purā proktā mayānagha jñāna-yogena sāṅkhyānāṁ karma-yogena yoginām",
    "english": "The Supreme Lord said: In this world, O Arjuna, there are two paths - the path of knowledge for the contemplative, and the path of action for the active.",
    "commentary": "Introduction to the two main spiritual paths.",
    "tags": [
      "gita",
      "krishna",
      "arjuna",
      "dharma",
      "yoga"
    ],
    "timestamp": "2025-10-04T14:17:22.477058"
  },
  {
    "id": "gita_ch3_v21",
    "source": "Bhagavad Gita",
    "category": "scripture",
    "chapter": 3,
    "verse": 21,
    "sanskrit": "यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः। स यत्प्रमाणं कुरुते लोकस्तदनुवर्तते॥",
    "transliteration": "yad yad ācarati śreṣṭhas tat tad evetaro janaḥ sa yat pramāṇaṁ kurute lokas tad anuvartate",
    "english": "Whatever action a great person performs, common people follow. Whatever standards they set, all the world pursues.",
    "commentary": "The importance of leadership by example.",
    "tags": [
      "gita",
      "krishna",
      "arjuna",
      "dharma",
      "yoga"
    ],
    "timestamp": "2025-10-04T14:17:22.477063"
  },
  {
    "id": "gita_ch4_v7",
    "source": "Bhagavad Gita",
    "category": "scripture",
    "chapter": 4,
    "verse": 7,
    "sanskrit": "यदा यदा हि धर्मस्य ग्लानिर्भवति भारत। अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥",
    "transliteration": "yadā yadā hi dharmasya glānir bhavati bhārata abhyutthānam adharmasya tadātmānaṁ sṛjāmy aham",
    "english": "Whenever there is a decline in righteousness and an increase in unrighteousness, O Bharata, at that time I manifest Myself on earth.",
    "commentary": "Famous verse about divine incarnation when dharma declines.",
    "tags": [
      "gita",
      "krishna",
      "arjuna",
      "dharma",
      "yoga"
    ],
    "timestamp": "2025-10-04T14:17:22.477067"
  },
  {
    "id": "gita_ch4_v8",
    "source": "Bhagavad Gita",
    "category": "scripture",
    "chapter": 4,
    "verse": 8,
    "sanskrit": "परित्राणाय साधूनां विनाशाय च दुष्कृताम्। धर्मसंस्थापनार्थाय सम्भवामि युगे युगे॥",
    "transliteration": "paritrāṇāya sādhūnāṁ vināśāya ca duṣkṛtām dharma-saṁsthāpanārthāya sambhavāmi yuge yuge",
    "english": "To deliver the pious and to annihilate the miscreants, as well as to reestablish the principles of dharma, I appear millennium after millennium.",
    "commentary": "The purpose of divine incarnations across ages.",
    "tags": [
      "gita",
      "krishna",
      "arjuna",
      "dharma",
      "yoga"
    ],
    "timestamp": "2025-10-04T14:17:22.477071"
  }
]